IDEA Open Model
Member1DType Enumeration
Compatible with IDEA StatiCa 20.1
 Type of Member 1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum Member1DType
Public Enumeration Member1DType
Members
Member name | Value | Description
Beam | 0 |  Beam member
Column | 1 |  Column member
Truss | 2 |  Truss member
Rib | 3 |  Rib member
BeamSlab | 4 |  Beam slab, rcs element
See Also
Reference
IdeaRS.OpenModel.Model Namespace